//==================================================================================================================================//
//!< @file		StageEffect.cpp
//!< @brief		ar::StageEffectクラス実装
//!< @author	T.Haga
//==================================================================================================================================//

/* Includes --------------------------------------------------------------------------------------------------- */

#include "StageEffect.h"

namespace ar
{

/* Unnamed Namespace ------------------------------------------------------------------------------------------ */

namespace
{

const float AreaCorrectionVal	= 576.f;		//!< 表示画面エリアの補正値. この値を使用して少し画面外まで描画するようにする。

}

/* Static Variable -------------------------------------------------------------------------------------------- */

sl::SLVECTOR2	StageEffect::m_BasePointPos		= {0.0f, 0.0f};
sl::fRect		StageEffect::m_DisplayArea		= {0.0f, 0.0f, 0.0f, 0.0f};

/* Public Functions ------------------------------------------------------------------------------------------- */

StageEffect::StageEffect(void)
	: m_pLibrary(sl::ISharokuLibrary::Instance())
	, m_Pos({0.0f, 0.0f})
{}

void StageEffect::Control(void)
{
	Run();
}

void StageEffect::Draw(void)
{
	// 画面外にあるオブジェクトは描画しない
	if( m_Pos.x < (m_BasePointPos.x - AreaCorrectionVal)
		|| m_Pos.x > (m_BasePointPos.x + AreaCorrectionVal + m_DisplayArea.m_Right))
	{
		return;
	}
	
	Render();
}
}	// namespace ar

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
