//==================================================================================================================================//
//!< @file		slTypes.h
//!< @brief		型定義をまとめたヘッダファイル
//!< @author	T.Haga
//==================================================================================================================================//

#ifndef SL_TYPES_H 
#define SL_TYPES_H


namespace sl
{

//======================================================================//
//!< 型定義
//======================================================================//

typedef unsigned long u_long;		// 符号なしロング型

typedef wchar_t w_char;				// ワイド文字

/** @todo 文字については改めて再検討する */
// UNICODEの設定でないならt_charはchar型になる
#ifdef  UNICODE
#ifndef SL_T_CHAR_DEFINED
typedef w_char t_char;
#define SL_T_CHAR_DEFINED
#endif	// SL_DEFINE_H
#else 
#ifndef SL_T_CHAR_DEFINED
typedef char t_char;
#define SL_T_CHAR_DEFINED
#endif  // SL_T_CHAR_DEFINED
#endif	// UNICODE

}	// namespace sl 


#endif	//  SL_TYPES_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//

