//==================================================================================================================================//
//!< @file		TilteText.h
//!< @brief		TilteTextクラスヘッダ
//!< @author	T.Haga
//==================================================================================================================================//

#ifndef AR_TITLE_TEXT_H
#define AR_TITLE_TEXT_H

#include "../SharokuLibrary/sl/sl.h"

namespace ar
{

//======================================================================//
//!< タイトルシーンのタイトル文字のクラス
//======================================================================//
class TitleText
{

public:
	/** 
	* Constructor 
	* @param[in] texID テクスチャーID
	*/
	explicit TitleText(int texID);

	/** Destructor */
	~TitleText(void);

	/** 描画関数 */
	void Draw(void);

private:
	sl::SLVECTOR2			m_Pos;					//!< 位置座標
	sl::GraphicsIDs			m_ID;					//!< グラフィック関連のIDをまとめた構造体
	sl::ISharokuLibrary*	m_pLibrary;				//!< ISharokuLibraryクラスのインスタンスへのポインタ
};

}	// namespace ar

#endif	// AR_TITLE_TEXT_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
