//==================================================================================================================================//
//!< @file		CreditsRollScene.h
//!< @brief		CreditsRollSceneクラスヘッダ
//!< @author	T.Haga
//==================================================================================================================================//

#pragma once
#include "../Scene.h"

namespace ar
{

//======================================================================//
//!< anagrAmbleにおけるエンドロールシーンのクラス
//======================================================================//
class CreditsRollScene : public Scene
{

public:
	/** Constructor */
	CreditsRollScene(void);

	/** Destructor */
	~CreditsRollScene(void);

private:
	/** 
	* コントロール関数 
	* @return 次のSceneID
	*/
	virtual Scene::ID Control(void)override;

	/** 描画関数 */
	virtual void Draw(void)override;
};

}	// namespace ar 

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
