//==================================================================================================================================//
//!< @file		MainGame.h
//!< @brief		MainGameクラスヘッダ
//!< @author	T.Haga
//==================================================================================================================================//

#ifndef MAIN_GAME_H
#define MAIN_GAME_H

namespace sl
{

class ISharokuLibrary;

}	// namespace sl

namespace ar
{

class SceneManager;

//======================================================================//
//!< ゲーム本体クラス
//!< ライブラリの初期化やゲームループなどを行う
//======================================================================//
class MainGame
{

public:
	/** Constructor */
	MainGame(void);

	/** Destructor */
	~MainGame(void);

	/** ゲームループ関数 */
	void Loop(void);

private:
	sl::ISharokuLibrary*			m_pLibrary;				//!< sl::ISharokuLibraryクラスのインスタンスへのポインタ
	SceneManager*					m_pSceneManager;		//!< SceneManagerクラスのインスタンスへのポインタ
};

} // namespace ar

#endif	// MAIN_GAME_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
